src/DataProcessors/ВыгрузкаПрайсаExcel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаПрайсаExcel</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/ВыгрузкаПрайсаExcel/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Асинх Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)  
	
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
    ДиалогСохраненияФайла.ПолноеИмяФайла = "Прайс-лист " + ВидЦены + " от " + Формат(ТекущаяДата(), "ДЛФ=D");
    ДиалогСохраненияФайла.Фильтр = "Файлы Excel (*.xlsx)|*.xlsx";
    ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
    ДиалогСохраненияФайла.Заголовок = "Выберите путь сохранения Прайс-листа";

    МассивИменФайлов = Ждать ДиалогСохраненияФайла.ВыбратьАсинх();

    Если ЗначениеЗаполнено(МассивИменФайлов) Тогда
        ПутьКФайлу = МассивИменФайлов[0];
	КонецЕсли;     
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)       
	
    Если Не ПроверитьЗаполнение() Тогда
        Возврат;
    КонецЕсли;
    
    ВыгрузитьВФайлНаСервере();
    
КонецПроцедуры

&НаСервере
Функция ТаблицаТекущийПрайсЛист()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    ЦеныНоменклатурыСрезПоследних.Номенклатура.Артикул КАК Артикул,
        |    ЦеныНоменклатурыСрезПоследних.Номенклатура.Наименование КАК Номенклатура,
        |    ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
        |ИЗ
        |    РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
        |ГДЕ
        |    ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены";
    
    Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
    
    РезультатЗапроса = Запрос.Выполнить();
    Возврат РезультатЗапроса.Выгрузить();
    
КонецФункции

&НаСервере
Процедура ВыгрузитьВФайлНаСервере()
    
    ТаблицаДанных = ТаблицаТекущийПрайсЛист();
    
    Если ТаблицаДанных.Количество() = 0 Тогда
        Сообщить("По выбранному виду цены не найдено установленных цен!");
        Возврат;
    КонецЕсли;
    
    ТабличныйДокумент = Новый ТабличныйДокумент;
    
    Построитель = Новый ПостроительОтчета;
    Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаДанных);
    Построитель.Вывести(ТабличныйДокумент);
    
    Попытка
        ТабличныйДокумент.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.XLSX);
        Сообщить("Выгрузка завершена! файл: " + ПутьКФайлу);
    Исключение
        Сообщить("Ошибка выгрузки: " + ОписаниеОшибки());
    КонецПопытки;
    
КонецПроцедуры

&НаСервере
Функция ПоказатьПрайсЛистНаСервере()
    
    ТаблицаДанных = ТаблицаТекущийПрайсЛист();
    
    Если ТаблицаДанных.Количество() = 0 Тогда
        Сообщить("По выбранному виду цены не найдено установленных цен!");
        Возврат Неопределено;
    КонецЕсли;
    
    ТабличныйДокумент = Новый ТабличныйДокумент;
    
    Построитель = Новый ПостроительОтчета;
    Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаДанных);
    Построитель.Вывести(ТабличныйДокумент);
		
    Возврат ТабличныйДокумент;
    
КонецФункции

&НаКлиенте
Процедура ПоказатьПрайсЛист(Команда)
    
    Если Не ПроверитьЗаполнение() Тогда
        Возврат;
    КонецЕсли;
    
    ТабличныйДокумент = ПоказатьПрайсЛистНаСервере();
    
    Если ТабличныйДокумент <> Неопределено Тогда
        ТабличныйДокумент.Показать();
    КонецЕсли;
    
КонецПроцедуры
